app/controllers/flowers_controller.rb

SELECT "flowers".* FROM "flowers"
---
  def index
    @flowers = Flower.all

INSERT INTO "flowers" ("user_id", "first_name", "last_name", "phone_number", "address", "postal_code", "product_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flower = Flower.new(flower_params)

    respond_to do |format|
      if @flower.save

UPDATE "flowers" SET "user_id" = ?, "first_name" = ?, "last_name" = ?, "phone_number" = ?, "address" = ?, "postal_code" = ?, "product_name" = ?, "updated_at" = ? WHERE "flowers"."id" = ?
---
  def update
    respond_to do |format|
      if @flower.update(flower_params)

DELETE FROM "flowers" WHERE "flowers"."id" = ?  [["id", 1]]
---
  def destroy
    @flower.destroy

SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_flower
      @flower = Flower.find(params[:id])